Repository: NagaLakshmi-coder/crop_prediction
Catalog: lib/l10n/app_*.arb
Languages: or

source: Welcome
or: ସ୍ୱାଗତ

source: Home
or: ମୂଳ ପୃଷ୍ଠା

source: Admin Dashboard
or: ପ୍ରଶାସକ ଡ୍ୟାଶବୋର୍ଡ

source: Farmer Dashboard
or: ଚାଷୀ ଡ୍ୟାଶବୋର୍ଡ

source: Welcome, Admin!
or: ସ୍ୱାଗତ, ପ୍ରଶାସକ!

source: Welcome, Farmer!
or: ସ୍ୱାଗତ, ଚାଷୀ!

source: Login
or: ଲଗିନ୍

source: Register
or: ରେଜିଷ୍ଟର

source: Select User Type
or: ଉପଯୋଗକର୍ତ୍ତା ପ୍ରକାର ଚୟନ କରନ୍ତୁ

source: Farmer
or: ଚାଷୀ

source: Admin
or: ପ୍ରଶାସକ

source: Email
or: ଇମେଲ୍

# invalid_email
source: Invalid email address
or: ଦୟାକରି ଏକ ବ valid ଧ ଇମେଲ୍ ଦିଅନ୍ତୁ

source: Password
or: ପାସୱାର୍ଡ

# invalid_password
source: Password must be at least 4 characters
or: ପାସୱାର୍ଡ କମ୍ରେ କମ୍ 4 ଅକ୍ଷରରୁ ଅଧିକ ହେବା ଆବଶ୍ୟକ

source: Name
or: ନାମ

# required
source: This field is required
or: ଏହି କ୍ଷେତ୍ର ଆବଶ୍ୟକ

# phone
source: Phone Number
or: ଫୋନ୍

# invalid_phone
source: Invalid phone number
or: ଦୟାକରି ଏକ ବ valid ଧ ଫୋନ୍ ନମ୍ବର ଦିଅନ୍ତୁ

source: Village
or: ଗାଁ

source: Crop Prediction
or: ଶସ୍ୟ ପୂର୍ବାନୁମାନ

source: Weather Forecast
or: ଆବହା ପୂର୍ବାନୁମାନ

# govt_schemes
source: Government Schemes
or: ସରକାରୀ ଯୋଜନା

source: Error fetching data
or: ତଥ୍ୟ ଆଣିବାରେ ତ୍ରୁଟି

source: Recommended Crop
or: ସୁପରିଶ କୃଷି

source: Expected Yield
or: ଆଶାକୃତ ଉତ୍ପାଦନ

source: Advice
or: ପରାମର୍ଶ

# temp
source: Temperature
or: ତାପମାତ୍ରା
